export interface Iplant {
	id: string;
    name: string;
	price: number;
	watering: string;
	lighting: string;
	temperature: string;
	description: string;
    imageUrl:string;
}

export const iPlants: Iplant[] = [
	{
	id: '1',
    name: ' بوتس في اصيص فخاري',
	price: 69,
	watering: 'لا يتم ريها إلا بعد جفاف التربة جزئياً مع المحافظة على رطوبتها، ويفضل رش أوراقها برذاذ الماء باستمرار كونها محبة للرطوبة.',
	lighting: 'تحتاج ضوء ساطع مرشح مثل ضوء النافذة او الانارة الصناعية داخل الغرفة.',
	temperature: 'تحتاج إلى جو معتدل ويناسبها درجة حرارة الغرفة الطبيعية وتتحمل الجو الدافئ حتى 30 درجة مئوية.',
	description: 'بوتس في اصيص فخاري ،تعتبر البوتس (Epipremnum aureum) النباتات الداخلية القوية والناجحة جداً، تتميز بلون جميل وتمتد بشكل سريع نسبياً ولاتحتاج للكثير من العناية، يمكن وضعها في دورات المياة أو في غرف الجلوس أو المكاتب.',
    imageUrl:'https://nabataty.com/store/wp-content/uploads/2022/08/10266-768x768.jpg',
	},
	{
	id: '22',
    name: 'كرمة المحبوب في اصيص فخاري',
	price: 63,
	watering: 'لا يتم ريها إلا بعد جفاف التربة	',
	lighting: 'تحتاج ضوء متوسط إلى ساطع مرشح مثل ضوء النافذة أو الانارة الصناعية للغرفة، كما يمكنها التأقلم مع الضوء الخافت.',
	temperature: 'تحتاج إلى جو معتدل يناسبها درجة حرارة الغرفة الطبيعية، وتتحمل الجو الدافئ حتى 35 درجة مئوية.',
	description: 'كرمة المحبوب (Philodendron Scandens-Araceae) في اصيص فخاري أنيق ، من النباتات الجميلة و السهلة في العناية، يمكن وضعها في غرف النوم أو صالات الجلوس أو في المكاتب.',
    imageUrl:'https://nabataty.com/store/wp-content/uploads/2022/08/10267.jpg.webp',
	},
	{
	id: '44',
    name: 'الاشرعة البيضاء في اصيص اسمنتي مزخرف',
	price: 120,
	watering: 'لا يتم ريها إلا بعد جفاف التربة جزئياً مع المحافظة على رطوبتها، ورش أوراقها برذاذ الماء باستمرار كونها محبة للرطوبة مع تجنب رش الازهار.',
	lighting: 'تحتاج ضوء ساطع مرشح مثل ضوء النافذة إلى متوسط مثل الانارة الصناعية داخل الغرفة.',
	temperature: 'تحتاج إلى جو معتدل ويناسبها درجة حرارة الغرفة الطبيعية وتتحمل الجو البارد حتى 12 درجة مئوية.',
	description: 'الأشرعة البيضاء او سباثيفيليوم او زنبق السلام (Spathiphyllum wallisii) من النباتات المنقية للجو، تتميز بمظهر أنيق وزهور بيضاء جميلة، يمكن وضعها في غرف النوم أو في صالات الجلوس.',
    imageUrl:'https://nabataty.com/store/wp-content/uploads/2022/07/10260-59.jpg.webp',
	},
	{
	id: '55',
    name: 'ببروميا روسو في اصيص سيراميك',
	price: 115,
	watering: 'لا يتم ريها إلا بعد جفاف التربة.',
	lighting: 'تحتاج ضوء ساطع إلى متوسط مرشح مثل ضوء النافذة أو الانارة الصناعية داخل الغرفة، ويمكن وضعها في الاماكن خافتة الضوء.',
	temperature: 'تحتاج إلى جو معتدل ويناسبها درجة حرارة الغرفة الطبيعية  بين 15 الى 25 درجة مئوية.',
	description: 'ببروميا روسو (Peperomia Rosso) في اصيص سيراميك انيق ،من النباتات الآمنة على الحيوانات الأليفة ولاتحتاج للكثير من العناية، يمكن وضعها في المنزل أو في بيئات العمل.',
    imageUrl:'https://nabataty.com/store/wp-content/uploads/2022/07/10255-768x768.jpg',
	},
	{
	id: '6',
    name: 'اجلونيما في اصيص اسمنتي منقوش',
	price: 138,
	watering: 'لا يتم ريها إلا بعد جفاف التربة جزئياً، ويفضل رش أوراقها برذاذ الماء لتوفير للرطوبة.',
	lighting: 'تحتاج ضوء خفيف إلى متوسط مرشح مثل ضوء النافذة أو الانارة الصناعية داخل الغرفة.',
	temperature: 'تحتاج إلى جو معتدل ويناسبها درجة حرارة الغرفة الطبيعية، وتتحمل الجو الدافئ حتى 30 درجة مئوية.',
	description: 'اجلونيما (Aglaonema) في أصيص اسمنتي انيق منقوش، تعتبر من النباتات الجميلة ذات الأوراق الكبيرة بلونها الأخضر المتموج، لاتحتاج للكثير من العناية، ويمكن وضعها في المنازل أو بيئات العمل المختلفة',
    imageUrl:'https://nabataty.com/store/wp-content/uploads/2022/07/10254-768x768.jpg',
	},
	{
	id: '7',
    name: 'نبتة الزاميا السوداء',
	price: 173,
	watering: 'لا يتم ريها إلا بعد جفاف التربة.',
	lighting: 'تحتاج ضوء متوسط إلى ساطع مرشح مثل ضوء النافذة أو الانارة الصناعية للغرفة، كما يمكنها التأقلم مع الضوء الخافت.',
	temperature: 'تحتاج إلى جو معتدل يناسبها درجة حرارة الغرفة الطبيعية، وتتحمل الجو الدافئ حتى 35 درجة مئوية.',
	description: 'زاميا ( Zamioculcas Raven) تعتبر من النباتات القوية والتي تتميز بأوراق سوداء داكنة ولامعة، لاتحتاج للكثير من العناية، كما تتأقلم في الضوء الخافت ويمكن وضعها في غرف النوم أو المكاتب',
    imageUrl:'https://nabataty.com/store/wp-content/uploads/2022/07/11192-768x768.jpg',
	},
	{
		id: '8',
		name: 'اريكا كبيرة 150 سم',
		price: 191,
		watering: 'لا يتم ريها إلا بعد جفاف التربة، ويفضل رش أوراقها برذاذ الماء كونها محبة للرطوبة',
		lighting: 'تحتاج ضوء ساطع مرشح مثل ضوء النافذة أو الانارة الصناعية للغرفة.',
		temperature:'تحتاج إلى جو معتدل يناسبها درجة حرارة الغرفة الطبيعية حتى 30 درجة مئوية.',
		description: 'اريكا ( Dypsis lutescens ) وتعرف أيضا بنخلة الفراشة لسعفاتها الشبيهة بالفراشات، تعتبر من النباتات الأمنة على الحيوانات الأليفة والمنقية للجو، نبتة جميلة وتضفي للمكان مظهراً مشرق بامتداد وميلان سعفاتها، يمكن وضعها في غرف النوم أو صالات الجلوس أو المكاتب',
		imageUrl:'https://nabataty.com/store/wp-content/uploads/2019/09/00159.jpg.webp',
		},
		{
			id: '9',
			name: 'كلانشو وردي مع مركن بلاستيك اصفر',
			price: 191,
			watering:'لا يتم ريها إلا بعد جفاف التربة جزئياً.',
			lighting: 'تحتاج ضوء ساطع مرشح مثل ضوء النافذة أو الانارة الصناعية للغرفة.',
			temperature:'تحتاج إلى جو معتدل يناسبها درجة حرارة الغرفة الطبيعية.',
			description: 'نبات الكلانشو أو الكلانكو (Kalanchoe blossfeldiana) مع اصيص بلاستيك اصفر تعتبر من النباتات العصارية، كما أنها نبتة مزهرة وأزهارها طويلة العمر، وتأخذ ألواناً عدة منها الأحمر والأصفر والبرتقالي والأرجواني، يمكن وضعها في المنازل أو بيئات العمل المختلفة',
			imageUrl:'https://nabataty.com/store/wp-content/uploads/2022/03/10076.jpg.webp',
			}		
]
